MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC131SD2AE/mcu.h
#define BPWM_CNT_DIRF_Pos                (16)                                               /*!< BPWM_T::CNT: DIRF Position                 */
#define BPWM_CNT_DIRF_Msk                (0x1ul << BPWM_CNT_DIRF_Pos)                       /*!< BPWM_T::CNT: DIRF Mask                     */

#define BPWM_WGCTL0_ZPCTLn_Pos           (0)                                                /*!< BPWM_T::WGCTL0: ZPCTLn Position            */
#define BPWM_WGCTL0_ZPCTLn_Msk           (0xffful << BPWM_WGCTL0_ZPCTLn_Pos)                /*!< BPWM_T::WGCTL0: ZPCTLn Mask                */

#define BPWM_WGCTL0_ZPCTL0_Pos           (0)                                                /*!< BPWM_T::WGCTL0: ZPCTL0 Position            */
#define BPWM_WGCTL0_ZPCTL0_Msk           (0x3ul << BPWM_WGCTL0_ZPCTL0_Pos)                  /*!< BPWM_T::WGCTL0: ZPCTL0 Mask                */

#define BPWM_WGCTL0_ZPCTL1_Pos           (2)                                                /*!< BPWM_T::WGCTL0: ZPCTL1 Position            */
#define BPWM_WGCTL0_ZPCTL1_Msk           (0x3ul << BPWM_WGCTL0_ZPCTL1_Pos)                  /*!< BPWM_T::WGCTL0: ZPCTL1 Mask                */

#define BPWM_WGCTL0_ZPCTL2_Pos           (4)                                                /*!< BPWM_T::WGCTL0: ZPCTL2 Position            */
#define BPWM_WGCTL0_ZPCTL2_Msk           (0x3ul << BPWM_WGCTL0_ZPCTL2_Pos)                  /*!< BPWM_T::WGCTL0: ZPCTL2 Mask                */

#define BPWM_WGCTL0_ZPCTL3_Pos           (6)                                                /*!< BPWM_T::WGCTL0: ZPCTL3 Position            */
#define BPWM_WGCTL0_ZPCTL3_Msk           (0x3ul << BPWM_WGCTL0_ZPCTL3_Pos)                  /*!< BPWM_T::WGCTL0: ZPCTL3 Mask                */

#define BPWM_WGCTL0_ZPCTL4_Pos           (8)                                                /*!< BPWM_T::WGCTL0: ZPCTL4 Position            */
#define BPWM_WGCTL0_ZPCTL4_Msk           (0x3ul << BPWM_WGCTL0_ZPCTL4_Pos)                  /*!< BPWM_T::WGCTL0: ZPCTL4 Mask                */

#define BPWM_WGCTL0_ZPCTL5_Pos           (10)                                               /*!< BPWM_T::WGCTL0: ZPCTL5 Position            */
#define BPWM_WGCTL0_ZPCTL5_Msk           (0x3ul << BPWM_WGCTL0_ZPCTL5_Pos)                  /*!< BPWM_T::WGCTL0: ZPCTL5 Mask                */

#define BPWM_WGCTL0_PRDPCTLn_Pos         (16)                                               /*!< BPWM_T::WGCTL0: PRDPCTLn Position          */
#define BPWM_WGCTL0_PRDPCTLn_Msk         (0xffful << BPWM_WGCTL0_PRDPCTLn_Pos)              /*!< BPWM_T::WGCTL0: PRDPCTLn Mask              */

#define BPWM_WGCTL0_PRDPCTL0_Pos         (16)                                               /*!< BPWM_T::WGCTL0: PRDPCTL0 Position          */
#define BPWM_WGCTL0_PRDPCTL0_Msk         (0x3ul << BPWM_WGCTL0_PRDPCTL0_Pos)                /*!< BPWM_T::WGCTL0: PRDPCTL0 Mask              */

#define BPWM_WGCTL0_PRDPCTL1_Pos         (18)                                               /*!< BPWM_T::WGCTL0: PRDPCTL1 Position          */
#define BPWM_WGCTL0_PRDPCTL1_Msk         (0x3ul << BPWM_WGCTL0_PRDPCTL1_Pos)                /*!< BPWM_T::WGCTL0: PRDPCTL1 Mask              */

#define BPWM_WGCTL0_PRDPCTL2_Pos         (20)                                               /*!< BPWM_T::WGCTL0: PRDPCTL2 Position          */
#define BPWM_WGCTL0_PRDPCTL2_Msk         (0x3ul << BPWM_WGCTL0_PRDPCTL2_Pos)                /*!< BPWM_T::WGCTL0: PRDPCTL2 Mask              */

#define BPWM_WGCTL0_PRDPCTL3_Pos         (22)                                               /*!< BPWM_T::WGCTL0: PRDPCTL3 Position          */
#define BPWM_WGCTL0_PRDPCTL3_Msk         (0x3ul << BPWM_WGCTL0_PRDPCTL3_Pos)                /*!< BPWM_T::WGCTL0: PRDPCTL3 Mask              */

#define BPWM_WGCTL0_PRDPCTL4_Pos         (24)                                               /*!< BPWM_T::WGCTL0: PRDPCTL4 Position          */
#define BPWM_WGCTL0_PRDPCTL4_Msk         (0x3ul << BPWM_WGCTL0_PRDPCTL4_Pos)                /*!< BPWM_T::WGCTL0: PRDPCTL4 Mask              */

#define BPWM_WGCTL0_PRDPCTL5_Pos         (26)                                               /*!< BPWM_T::WGCTL0: PRDPCTL5 Position          */
#define BPWM_WGCTL0_PRDPCTL5_Msk         (0x3ul << BPWM_WGCTL0_PRDPCTL5_Pos)                /*!< BPWM_T::WGCTL0: PRDPCTL5 Mask              */

#define BPWM_WGCTL1_CMPUCTLn_Pos         (0)                                                /*!< BPWM_T::WGCTL1: CMPUCTLn Position          */
#define BPWM_WGCTL1_CMPUCTLn_Msk         (0xffful << BPWM_WGCTL1_CMPUCTLn_Pos)              /*!< BPWM_T::WGCTL1: CMPUCTLn Mask              */

#define BPWM_WGCTL1_CMPUCTL0_Pos         (0)                                                /*!< BPWM_T::WGCTL1: CMPUCTL0 Position          */
#define BPWM_WGCTL1_CMPUCTL0_Msk         (0x3ul << BPWM_WGCTL1_CMPUCTL0_Pos)                /*!< BPWM_T::WGCTL1: CMPUCTL0 Mask              */

#define BPWM_WGCTL1_CMPUCTL1_Pos         (2)                                                /*!< BPWM_T::WGCTL1: CMPUCTL1 Position          */
#define BPWM_WGCTL1_CMPUCTL1_Msk         (0x3ul << BPWM_WGCTL1_CMPUCTL1_Pos)                /*!< BPWM_T::WGCTL1: CMPUCTL1 Mask              */

#define BPWM_WGCTL1_CMPUCTL2_Pos         (4)                                                /*!< BPWM_T::WGCTL1: CMPUCTL2 Position          */
#define BPWM_WGCTL1_CMPUCTL2_Msk         (0x3ul << BPWM_WGCTL1_CMPUCTL2_Pos)                /*!< BPWM_T::WGCTL1: CMPUCTL2 Mask              */

#define BPWM_WGCTL1_CMPUCTL3_Pos         (6)                                                /*!< BPWM_T::WGCTL1: CMPUCTL3 Position          */
#define BPWM_WGCTL1_CMPUCTL3_Msk         (0x3ul << BPWM_WGCTL1_CMPUCTL3_Pos)                /*!< BPWM_T::WGCTL1: CMPUCTL3 Mask              */

#define BPWM_WGCTL1_CMPUCTL4_Pos         (8)                                                /*!< BPWM_T::WGCTL1: CMPUCTL4 Position          */
#define BPWM_WGCTL1_CMPUCTL4_Msk         (0x3ul << BPWM_WGCTL1_CMPUCTL4_Pos)                /*!< BPWM_T::WGCTL1: CMPUCTL4 Mask              */

